In [333]:
import sqlite3

# Kết nối đến database (tạo mới nếu chưa có)
conn = sqlite3.connect(":memory:")  # Database trong RAM
cursor = conn.cursor()

# Tạo bảng student
cursor.execute("""
CREATE TABLE student (
    student_id INTEGER PRIMARY KEY,
    name TEXT,
    class TEXT,
    course_id INTEGER,
    score REAL
);
""")

# Tạo bảng course
cursor.execute("""
CREATE TABLE course (
    id INTEGER PRIMARY KEY,
    course_name TEXT
);
""")

# Dữ liệu student
students_data = [
    (1, "Nguyen Minh Hoang", "May Tinh", 12, 6.7),
    (2, "Tran Thi Lan", "Kinh Te", 34, 9.2),
    (3, "Pham Van Nam", "Toan Tin", None, 7.9),
    (4, "Le Thanh Huyen", "Toan Tin", 20, 7.2),
    (5, "Vu Quoc Anh", "May Tinh", 24, 8.0),
    (6, "Dang Thuy Linh", "May Tinh", 24, 5.5),
    (7, "Bui Tien Dung", "Kinh Te", 34, 9.2),
    (8, "Ho Ngoc Mai", "Toan Tin", 20, 8.8),
    (9, "Duong Huu Phuc", "Kinh Te", None, 7.2),
    (10, "Cao Thi Hanh", "May Tinh", None, 7.0)
]

cursor.executemany("INSERT INTO student VALUES (?, ?, ?, ?, ?);", students_data)

# Dữ liệu course
courses_data = [
    (12, "Giai tich"),
    (34, "Thong ke"),
    (26, "Tin hoc")
]

cursor.executemany("INSERT INTO course VALUES (?, ?);", courses_data)

conn.commit()

In [335]:
cursor.execute("""
SELECT * FROM student, course;
""")
print("Tích Descartes:")
for row in cursor.fetchall():
    print(row)

Tích Descartes:
(1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7, 12, 'Giai tich')
(1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7, 26, 'Tin hoc')
(1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7, 34, 'Thong ke')
(2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2, 12, 'Giai tich')
(2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2, 26, 'Tin hoc')
(2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2, 34, 'Thong ke')
(3, 'Pham Van Nam', 'Toan Tin', None, 7.9, 12, 'Giai tich')
(3, 'Pham Van Nam', 'Toan Tin', None, 7.9, 26, 'Tin hoc')
(3, 'Pham Van Nam', 'Toan Tin', None, 7.9, 34, 'Thong ke')
(4, 'Le Thanh Huyen', 'Toan Tin', 20, 7.2, 12, 'Giai tich')
(4, 'Le Thanh Huyen', 'Toan Tin', 20, 7.2, 26, 'Tin hoc')
(4, 'Le Thanh Huyen', 'Toan Tin', 20, 7.2, 34, 'Thong ke')
(5, 'Vu Quoc Anh', 'May Tinh', 24, 8.0, 12, 'Giai tich')
(5, 'Vu Quoc Anh', 'May Tinh', 24, 8.0, 26, 'Tin hoc')
(5, 'Vu Quoc Anh', 'May Tinh', 24, 8.0, 34, 'Thong ke')
(6, 'Dang Thuy Linh', 'May Tinh', 24, 5.5, 12, 'Giai tich')
(6, 'Dang Thuy Linh', 'May Tinh', 24, 5.5, 26, 'Tin hoc')
(6, 'Dang Thuy Linh', 'May Tinh', 24, 5.5, 34, 'Thong ke')
(7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2, 12, 'Giai tich')
(7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2, 26, 'Tin hoc')
(7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2, 34, 'Thong ke')
(8, 'Ho Ngoc Mai', 'Toan Tin', 20, 8.8, 12, 'Giai tich')
(8, 'Ho Ngoc Mai', 'Toan Tin', 20, 8.8, 26, 'Tin hoc')
(8, 'Ho Ngoc Mai', 'Toan Tin', 20, 8.8, 34, 'Thong ke')
(9, 'Duong Huu Phuc', 'Kinh Te', None, 7.2, 12, 'Giai tich')
(9, 'Duong Huu Phuc', 'Kinh Te', None, 7.2, 26, 'Tin hoc')
(9, 'Duong Huu Phuc', 'Kinh Te', None, 7.2, 34, 'Thong ke')
(10, 'Cao Thi Hanh', 'May Tinh', None, 7.0, 12, 'Giai tich')
(10, 'Cao Thi Hanh', 'May Tinh', None, 7.0, 26, 'Tin hoc')
(10, 'Cao Thi Hanh', 'May Tinh', None, 7.0, 34, 'Thong ke')

In [337]:
cursor.execute("""
SELECT student.student_id, student.name, student.class, student.course_id, 
       student.score, course.course_name 
FROM student 
INNER JOIN course ON student.course_id = course.id;
""")
print("\nINNER JOIN:")
for row in cursor.fetchall():
    print(row)

INNER JOIN:
(1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7, 'Giai tich')
(2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2, 'Thong ke')
(7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2, 'Thong ke')

In [339]:
cursor.execute("""
SELECT student.student_id, student.name, student.class, student.course_id, 
       student.score, course.course_name 
FROM student 
LEFT JOIN course ON student.course_id = course.id;
""")
print("\nLEFT JOIN:")
for row in cursor.fetchall():
    print(row)

LEFT JOIN:
(1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7, 'Giai tich')
(2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2, 'Thong ke')
(3, 'Pham Van Nam', 'Toan Tin', None, 7.9, None)
(4, 'Le Thanh Huyen', 'Toan Tin', 20, 7.2, None)
(5, 'Vu Quoc Anh', 'May Tinh', 24, 8.0, None)
(6, 'Dang Thuy Linh', 'May Tinh', 24, 5.5, None)
(7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2, 'Thong ke')
(8, 'Ho Ngoc Mai', 'Toan Tin', 20, 8.8, None)
(9, 'Duong Huu Phuc', 'Kinh Te', None, 7.2, None)
(10, 'Cao Thi Hanh', 'May Tinh', None, 7.0, None)

In [341]:
cursor.execute("""
SELECT student.student_id, student.name, student.class, student.course_id, 
       student.score, course.course_name 
FROM course 
LEFT JOIN student ON student.course_id = course.id;
""")
print("\nRIGHT JOIN (mô phỏng bằng LEFT JOIN):")
for row in cursor.fetchall():
    print(row)

RIGHT JOIN (mô phỏng bằng LEFT JOIN):
(1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7, 'Giai tich')
(None, None, None, None, None, 'Tin hoc')
(7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2, 'Thong ke')
(2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2, 'Thong ke')

In [343]:
cursor.execute("""
SELECT student.student_id, student.name, student.class, student.course_id, 
       student.score, course.course_name 
FROM student 
LEFT JOIN course ON student.course_id = course.id
UNION
SELECT student.student_id, student.name, student.class, student.course_id, 
       student.score, course.course_name 
FROM student 
RIGHT JOIN course ON student.course_id = course.id;
""")
print("\nFULL OUTER JOIN (mô phỏng bằng UNION):")
for row in cursor.fetchall():
    print(row)

FULL OUTER JOIN (mô phỏng bằng UNION):
(None, None, None, None, None, 'Tin hoc')
(1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7, 'Giai tich')
(2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2, 'Thong ke')
(3, 'Pham Van Nam', 'Toan Tin', None, 7.9, None)
(4, 'Le Thanh Huyen', 'Toan Tin', 20, 7.2, None)
(5, 'Vu Quoc Anh', 'May Tinh', 24, 8.0, None)
(6, 'Dang Thuy Linh', 'May Tinh', 24, 5.5, None)
(7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2, 'Thong ke')
(8, 'Ho Ngoc Mai', 'Toan Tin', 20, 8.8, None)
(9, 'Duong Huu Phuc', 'Kinh Te', None, 7.2, None)
(10, 'Cao Thi Hanh', 'May Tinh', None, 7.0, None)

# Tích Descartes : 30 hàng (mỗi sinh viên được ghép với mỗi khóa học).
# INNER JOIN : Chỉ những sinh viên có course_id là 12 hoặc 34 (khớp với bảng khóa học ), do đó có 4 hàng (sinh viên 1, 2, 7).
# LEFT JOIN : Tất cả 10 sinh viên, với course_name là NULL cho course_id 0, 20, 24.
# RIGHT JOIN (mô phỏng) : Cả 3 khóa học, với dữ liệu sinh viên NULL cho course.id = 26 .
# FULL OUTER JOIN (mô phỏng) : Tất cả học viên và tất cả khóa học, bao gồm cả các hàng không khớp (ví dụ: course.id = 26 nhưng không có học viên nào).

In [345]:
# Cập nhật các giá trị thiếu trong course_id
cursor.execute("""
UPDATE student
SET course_id = (
    SELECT id FROM course ORDER BY RANDOM() LIMIT 1
)
WHERE course_id IS NULL;
""")

# Xóa các bản ghi có course_id không tồn tại trong bảng course
cursor.execute("""
DELETE FROM student
WHERE course_id NOT IN (SELECT id FROM course);
""")

conn.commit()

# Xóa các bản ghi mà course_id vẫn chưa tồn tại trong bảng khóa học (nếu có)
cursor.execute('''
    DELETE FROM student
    WHERE course_id NOT IN (SELECT id FROM course)
''')

# Cam kết thay đổi
conn.commit()

# Xác minh bảng cập nhật
cursor.execute('SELECT * FROM student')
print("Updated student table:")
for row in cursor.fetchall():
    print(row)

# a. Tổng số sinh viên, điểm trung bình của từng lớp
query_class_stats = '''
    SELECT class, COUNT(*) as total_students, AVG(score) as avg_score
    FROM student
    GROUP BY class
'''
print("\n(a) Tổng số sinh viên, điểm trung bình của từng lớp:")
cursor.execute(query_class_stats)
for row in cursor.fetchall():
    print(f"Lớp: {row[0]}, Số sinh viên: {row[1]}, Điểm trung bình: {row[2]:.2f}")

# b. Tổng số sinh viên, điểm trung bình của từng môn học
query_course_stats = '''
    SELECT c.course_name, COUNT(*) as total_students, AVG(s.score) as avg_score
    FROM student s
    JOIN course c ON s.course_id = c.id
    GROUP BY c.course_name
'''
print("\n(b) Tổng số sinh viên, điểm trung bình của từng môn học:")
cursor.execute(query_course_stats)
for row in cursor.fetchall():
    print(f"Môn học: {row[0]}, Số sinh viên: {row[1]}, Điểm trung bình: {row[2]:.2f}")

# c. Phân loại thi đua theo số điểm trung bình của từng môn học
query_classification = '''
    SELECT c.course_name,
           AVG(s.score) as avg_score,
           CASE
               WHEN AVG(s.score) > 9.0 THEN 'Xuất sắc'
               WHEN AVG(s.score) BETWEEN 6.0 AND 8.9 THEN 'Tốt'
               WHEN AVG(s.score) < 6.0 THEN 'Kém'
           END as classification
    FROM student s
    JOIN course c ON s.course_id = c.id
    GROUP BY c.course_name
'''
print("\n(c) Phân loại thi đua theo số điểm trung bình của từng môn học:")
cursor.execute(query_classification)
for row in cursor.fetchall():
    print(f"Môn học: {row[0]}, Điểm trung bình: {row[1]:.2f}, Xếp loại: {row[2]}")

Updated student table:
(1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7)
(2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2)
(3, 'Pham Van Nam', 'Toan Tin', 12, 7.9)
(7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2)
(9, 'Duong Huu Phuc', 'Kinh Te', 12, 7.2)
(10, 'Cao Thi Hanh', 'May Tinh', 12, 7.0)

(a) Tổng số sinh viên, điểm trung bình của từng lớp:
Lớp: Kinh Te, Số sinh viên: 3, Điểm trung bình: 8.53
Lớp: May Tinh, Số sinh viên: 2, Điểm trung bình: 6.85
Lớp: Toan Tin, Số sinh viên: 1, Điểm trung bình: 7.90

(b) Tổng số sinh viên, điểm trung bình của từng môn học:
Môn học: Giai tich, Số sinh viên: 4, Điểm trung bình: 7.20
Môn học: Thong ke, Số sinh viên: 2, Điểm trung bình: 9.20

(c) Phân loại thi đua theo số điểm trung bình của từng môn học:
Môn học: Giai tich, Điểm trung bình: 7.20, Xếp loại: Tốt
Môn học: Thong ke, Điểm trung bình: 9.20, Xếp loại: Xuất sắc

In [347]:
print("\nXếp hạng sinh viên theo điểm số:")
cursor.execute("""
SELECT student_id, name, score, RANK() OVER (ORDER BY score DESC) AS rank
FROM student;
""")
for row in cursor.fetchall():
    print(row)

Xếp hạng sinh viên theo điểm số:
(2, 'Tran Thi Lan', 9.2, 1)
(7, 'Bui Tien Dung', 9.2, 1)
(3, 'Pham Van Nam', 7.9, 3)
(9, 'Duong Huu Phuc', 7.2, 4)
(10, 'Cao Thi Hanh', 7.0, 5)
(1, 'Nguyen Minh Hoang', 6.7, 6)

In [349]:
print("\nXếp hạng sinh viên theo lớp học:")
cursor.execute("""
SELECT student_id, name, class, score, RANK() OVER (PARTITION BY class ORDER BY score DESC) AS rank
FROM student;
""")
for row in cursor.fetchall():
    print(row)

Xếp hạng sinh viên theo lớp học:
(2, 'Tran Thi Lan', 'Kinh Te', 9.2, 1)
(7, 'Bui Tien Dung', 'Kinh Te', 9.2, 1)
(9, 'Duong Huu Phuc', 'Kinh Te', 7.2, 3)
(10, 'Cao Thi Hanh', 'May Tinh', 7.0, 1)
(1, 'Nguyen Minh Hoang', 'May Tinh', 6.7, 2)
(3, 'Pham Van Nam', 'Toan Tin', 7.9, 1)

In [351]:
print("\nXếp hạng sinh viên theo môn học:")
cursor.execute("""
SELECT student_id, name, course_name, score, RANK() OVER (PARTITION BY course_id ORDER BY score DESC) AS rank
FROM student
JOIN course ON student.course_id = course.id;
""")
for row in cursor.fetchall():
    print(row)

Xếp hạng sinh viên theo môn học:
(3, 'Pham Van Nam', 'Giai tich', 7.9, 1)
(9, 'Duong Huu Phuc', 'Giai tich', 7.2, 2)
(10, 'Cao Thi Hanh', 'Giai tich', 7.0, 3)
(1, 'Nguyen Minh Hoang', 'Giai tich', 6.7, 4)
(2, 'Tran Thi Lan', 'Thong ke', 9.2, 1)
(7, 'Bui Tien Dung', 'Thong ke', 9.2, 1)

In [353]:
print("\nTop 3 sinh viên có điểm cao nhất:")
cursor.execute("""
SELECT student_id, name, score
FROM student
ORDER BY score DESC
LIMIT 3;
""")
for row in cursor.fetchall():
    print(row)

print("\nTop 3 sinh viên có điểm thấp nhất:")
cursor.execute("""
SELECT student_id, name, score
FROM student
ORDER BY score ASC
LIMIT 3;
""")
for row in cursor.fetchall():
    print(row)

Top 3 sinh viên có điểm cao nhất:
(2, 'Tran Thi Lan', 9.2)
(7, 'Bui Tien Dung', 9.2)
(3, 'Pham Van Nam', 7.9)

Top 3 sinh viên có điểm thấp nhất:
(1, 'Nguyen Minh Hoang', 6.7)
(10, 'Cao Thi Hanh', 7.0)
(9, 'Duong Huu Phuc', 7.2)

In [355]:
from datetime import datetime, timedelta
# Thêm trường graduation_date vào bảng student
cursor.execute('''
    ALTER TABLE student
    ADD COLUMN graduation_date DATETIME
''')

# Lấy ngày hiện tại
current_date = datetime(2025, 3, 13)

# Cập nhật graduation_date cho từng sinh viên
for student_id in range(1, 11):  # Dựa trên 10 sinh viên trong bảng
    # Tính graduation_date bằng cách cộng student_id năm vào ngày hiện tại
    graduation_date = current_date + timedelta(days=365 * student_id)
    cursor.execute('''
        UPDATE student
        SET graduation_date = ?
        WHERE student_id = ?
    ''', (graduation_date, student_id))

# Lưu thay đổi
conn.commit()

# Kiểm tra dữ liệu (tùy chọn)
cursor.execute('SELECT * FROM student')
print(cursor.fetchall())

# Đóng kết nối
conn.close()

[(1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7, '2026-03-13 00:00:00'), (2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2, '2027-03-13 00:00:00'), (3, 'Pham Van Nam', 'Toan Tin', 12, 7.9, '2028-03-12 00:00:00'), (7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2, '2032-03-11 00:00:00'), (9, 'Duong Huu Phuc', 'Kinh Te', 12, 7.2, '2034-03-11 00:00:00'), (10, 'Cao Thi Hanh', 'May Tinh', 12, 7.0, '2035-03-11 00:00:00')]

C:\Users\caoqu\AppData\Local\Temp\ipykernel_10192\3171182252.py:15: DeprecationWarning: The default datetime adapter is deprecated as of Python 3.12; see the sqlite3 documentation for suggested replacement recipes
  cursor.execute('''